# GetDashStyle

## Description
Deprecated - will generate error. Use GetDashStyleN instead.

```pascal
FUNCTION GetDashStyle(
				swt      : BOOLEAN;
				numPairs : INTEGER;
				pair1    : REAL;
				pair2    : REAL;
				pair3    : REAL;
				pair4    : REAL;
				pair5    : REAL) : INTEGER;
```

```python

def vs.GetDashStyle(swt, numPairs, pair1, pair2, pair3, pair4, pair5):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|swt|BOOLEAN||
|numPairs|INTEGER||
|pair1|REAL||
|pair2|REAL||
|pair3|REAL||
|pair4|REAL||
|pair5|REAL||

## Remarks
Deprecated - will generate error. Use GetDashStyleN instead.

## Examples
```pascal
currLS:=GetDashStyle;
```

## See Also
VS Functions:
GetDashStyleN

## Version
```diff
- GetDashStyle is obsolete as of Vectorworks 2019
```

Availability: from MiniCAD5.0
## Category
* Document Attributes